catalog={
 "Нидерланды":"Амстердам",
    "Андорра":"Андорра-ла-Велья",
    "Греция":"Афины",
    "Сербия":"Белград",
    "Германия":"Берлин",
    "Швейцария":"Берн",
    "Словакия":"Братислава",
    "Бельгия":"Брюссель",
    "Венгрия":"Будапешт",
    "Румыния":"Бухарест",
    "Лихтенштейн":"Вадуц",
    "Мальта":"Валлетта",
    "Польша":"Варшава",
    "Ватикан":"Ватикан",
    "Австрия":"Вена",
    "Литва":"Вильнюс",
    "Ирландия":"Дублин",
    "Хорватия":"Загреб",
    "Украина":"Киев",
    "Молдавия":"Кишинёв",
    "Дания":"Копенгаген",
    "Португалия":"Лиссабон",
    "Великобритания":"Лондон",
    "Словения":"Любляна",
    "Люксембург":"Люксембург",
    "Испания":"Мадрид",
    "Беларусь":"Минск",
    "Монако":"Монако",
    "Россия":"Москва",
    "Норвегия":"Осло",
    "Франция":"Париж",
    "Черногория":"Подгорица",
    "Чехия":"Прага",
    "Исландия":"Рейкьявик",
    "Латвия":"Рига",
    "Италия":"Рим",
    "Сан-Марино":"Сан-Марино",
    "Босния и Герцеговина":"Сараево",
    "Северная Македония":"Скопье",
    "Болгария":"София",
    "Швеция":"Стокгольм",
    "Эстония":"Таллин",
    "Албания":"Тирана",
    "Финляндия":"Хельсинки"
}
print("-"*100)
#цикл для работы с каталогом
while True:
    print('Список возможных действий:')
    print('1 - Добавить навую страну')
    print('2 - Поиск страны по названию')
    print('3 - Удаление страны из каталога')
    print('4 - Показать информацию о всех странах в каталоге')
    print('0 - Закончить работу')
    print("-" * 100)
    # запрашиваем у пользователя номер действия:
    user_choice=int(input("Выберите № действия: "))
    if user_choice == 1:
        country=input("Введите название страны: ")
        if country in catalog:
            print("Такая страна уже существует! введите другую")
        else:
            capital = input("Введите столицу страны: ")
            catalog[country]=capital
            print(f"{country} с {capital} была добаблена в каталог")
    elif user_choice == 2:
        country=input("Введите название страны: ")
        if country in   catalog:
            print(f"Страна: {country}, Столица: {catalog[country]}")
        else:
            print("Страна не найдена")
    elif user_choice == 3:
        country = input("Введите название страны: ")
        if country in catalog:
            del catalog[country]
            print(f"{country} была удалена")
        else:
            print("Страна не найдена")
    elif user_choice == 4:
        for country, capital in catalog.items():
            print(f"Страна:{country}, Столица: {capital}")
    elif user_choice == 0:
        print("Выход из программы")
        break
    else:
        print("Неверный выбор выберите действия от 1 до 4")